model:
  type: 'RTLSTD'
  patch_size: 128
  backbone:
    type: 'ResNet'
    config:
      input_dimension: 3
      structure:
        [[-1, 1, Conv, [64, 3, 2, 1, 1, False, True, 'nn.ReLU(inplace=True)']],
         [-1, 1, Conv, [64, 3, 1, 1, 1, False, True, 'nn.ReLU(inplace=True)']],
         [-1, 1, Conv, [128, 3, 1, 1, 1, False, True, 'nn.ReLU(inplace=True)']],
         [-1, 1, MaxPool, [3, 2, 1]],
         [-1, 1, ResBasicBlock, [64, 1]],
         [-1, 1, ResBasicBlock, [64, 1]],
         [-1, 1, ResBasicBlock, [128, 2]],
         [-1, 1, ResBasicBlock, [128, 1]]
        ]
        
